[{ "date": { "year": 2020, "month": 4, "day": 17}, "time":{ "hour": 9, "minute": 30, "timeZone": "CST" }, "venue": "KXCV-KRNW Facebook Page", "desc": "Individuals are invited to participate – anytime, anywhere – by clocking their times and then sending a selfie and photo of their results to helenk@nwmissouri.edu or by posting to the KXCV-KRNW Facebook page."},
{ "date": { "year": 2020, "month": 4, "day": 18},"time":{ "hour": 16, "minute": 0, "timeZone": "CST" }, "venue": "The Station, Maryville", "desc": "Learn to recognize and effectively manage stress in fun, healthy ways! All students, faculty and staff are welcome."},
{ "date": { "year": 2020, "month": 4, "day": 19},"time":{ "hour": 8, "minute": 30, "timeZone": "CST" }, "venue": "Career Services, Administration Building, NWMSU", "desc":"This is a come and go session focused on helping students find internships and full-time jobs. Students are welcome to attend at any stage in the search process. Career Services staff and student Career Ambassadors will be on hand to answer questions and help. Coffee and other drinks are available and free of charge for students who attend." },
{ "date": { "year": 2020, "month": 4, "day": 20},"time":{ "hour": 19, "minute": 30, "timeZone": "CST" }, "venue": "Ron Houston Center for Performing Arts, Maryville", "desc":"The Northwest Orchestra and the Symphonic Band perform at 7:30 p.m. in the Mary Linn Auditorium at the Ron Houston Center for the Performing Arts. The concert is free and open to the public." },
{ "date": { "year": 2020, "month": 4, "day": 20},"time":{ "hour": 17, "minute": 0, "timeZone": "CST" }, "venue": "Student Rec Center, NWMSU", "desc":"Campus Recreation is having a Dodgeball Tournament on April 21st in the SRC. Make sure and bring Bearcat cards to all games to check in. " },
{ "date": { "year": 2020, "month": 4, "day": 21},"time":{ "hour": 12, "minute": 0, "timeZone": "CST" }, "venue": "JW Jones Student Union, NWMSU", "desc":"These sessions introduce individuals to the ancient practices of mindfulness and meditation and allow participants to engage in the practice of meditation on a regular basis. Participants are encouraged to bring a pillow or thick towel to sit on." },
{ "date": { "year": 2020, "month": 4, "day": 22},"time":{ "hour": 14, "minute": 30, "timeZone": "CST" }, "venue": "BD Owens Library, NWMSU", "desc":"The activity provides an opportunity for students, staff and faculty to connect. Make new friends from around the globe, connect with old friends and have fun." }
]   